{"getting_started":{"title":"getting_started","links":[],"tags":[],"content":"Overview\nDuring the time contributing to the liberdus project, creating a local network is a great way to test your changes and see how they affect the network. This guide will walk you through the process of setting up a local network and launching it.\nLiberdus network is built on top of shardus protocol which is framework for building sharded and decentralized apps. The primary library @shardus/core is powered by rust binded networking protocol.\nPrerequisites\nMake sure you system has the following installed:\n\nRust\nNode.js\nPython3\n\nThe exact version of nodejs version required can be oberseved in liberdus/server’s package.json file.\nCloning the repositories\nFirst, clone the liberdus repository to your local machine. You can do this by running the following command:\ngit clone github.com/Liberdus/server.git\nPlease use dev branch for the latest changes.\ngit checkout dev\nOnce the repository is cloned, navigate to the repo directory and install the dependencies by running:\ncd server\nnpm install\nTo launch a local network, shardus provide a process manager that allow you to launch multiple network along with an archiver and monitoring system to form a working network. Install the shardus cli tool by running:\nnpm install -g shardus\nLaunching the network\nTo launch a local network, you can use the shardus cli tool. The following command will launch a network with 10 validator node, archiver node and a monitor server.\nshardus create-net 10\nAfter creating the network, you can observe the network status by visiting http://localhost:3000.\nLaunching the rpc server\nClone the rpc server repository to your local machine. You can do this by running the following command:\ngit clone git@github.com:Liberdus/liberdus-rpc.git\nOnce the repository is cloned, navigate to the repo directory and install the dependencies by running:\ncd liberdus-rpc\nrustup install 1.81\nrustup default 1.81\nTo launch the server, run the following command:\ncargo run\nRPC server will be running on http://localhost:8545.\nLaunching the liberdus demo client\nIn order to interact with the network, you can use the liberdus demo client. Clone the repository to your local machine by running the following command:\ngit clone github.com/Liberdus/liberdus-web-client.git\nTo run the vue project\ncd liberdus-web-client\nnpm install\nnpm run serve"},"index":{"title":"index","links":["getting_started"],"tags":[],"content":"Welcome contributors!\nThis documentation site is dedicated for contributing changes to liberdus network tech stack itself. Here are some useful links to get you started:\n\nGetting Started\n"}}